Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/food_safety/food_safety_and_environmental_health_services.html.txt.tmx
Source language: en
Languages: ga

source: Food safety and environmental health services
ga: Sábháilteacht bia agus seirbhísí sláinte comhshaoil

source: A number of different agencies have a role in food safety and environmental health services in Ireland and throughout the European Union (EU)
ga: Tá ról ag roinnt gníomhaireachtaí éagsúla i seirbhísí sábháilteachta bia agus sláinte comhshaoil in Éirinn agus ar fud an Aontais Eorpaigh (AE)

source: The Department of Health has an overall policy role on food hygiene and safety in Ireland
ga: Tá ról foriomlán beartais ag an Roinn Sláinte maidir le sláinteachas agus sábháilteacht bia in Éirinn

source: The Department of Agriculture, Food and the Marine has responsibility for a number of areas, mainly primary food products and animal health
ga: Tá an Roinn Talmhaíochta, Bia agus Mara freagrach as líon limistéar, go príomha táirgí príomhúla bia agus sláinte ainmhithe

source: Local authorities and the Health Service Executive (HSE) also have a role in implementing food safety rules
ga: Anuas air sin, tá ról ag údaráis áitiúla agus ag Feidhmeannacht na Seirbhíse Sláinte (FSS) chun rialacha sábháilteachta bia a chur i bhfeidhm

source: The Food Safety Authority of Ireland has the overall co-ordinating role for food safety control programmes and monitoring
ga: Tá an ról foriomlán comhordaithe ag Údarás Sábháilteachta Bia na hÉireann le haghaidh cláir rialála agus mhonatóireachta sábháilteachta bia

source: It works with the agencies listed above and with other agencies including the Sea-Fisheries Protection Authority, which is responsible for seafood safety
ga: Oibríonn siad leis na gníomhaireachtaí a liostaítear thuas agus le gníomhaireachtaí eile, lena n-áirítear an tÚdarás um Chosaint Iascaigh Mhara, atá freagrach as sábháilteacht bia mara

source: The Health Products Regulatory Authority is the statutory body that regulates medicines, medical devices and other health products
ga: Is iad an tÚdarás Rialála Táirgí Sláinte an comhlacht reachtúil a rialaíonn cógais, feistí leighis agus táirgí eile sláinte

source: Safefood – the Food Safety Promotion Board is a cross-border body set up under the Good Friday Agreement to promote food safety on the island of Ireland
ga: Is comhlacht trasteorann iad Safefood – an Bord um Chur chun Cinn na Sábháilteachta Bia a bunaíodh faoi Chomhaontú Aoine an Chéasta chun sábháilteacht bia a chur chun cinn ar oileán na hÉireann

source: The Food Safety Authority of Ireland provides comprehensive information on Irish and international food laws
ga: Soláthraíonn Údarás Sábháilteachta Bia na hÉireann faisnéis chuimsitheach ar dhlíthe Éireannacha agus idirnáisiúnta bia

source: Department of Agriculture, Food and the Marine
ga: An Roinn Talmhaíochta, Bia agus Mara

source: The Department has overall responsibility for animal health and welfare and for some areas of plant health
ga: Tá an fhreagracht fhoriomlán ar an Roinn as sláinte agus leas ainmhithe agus as roinnt limistéar de shláinte phlandaí

source: It also has direct responsibility in a number of primary product areas
ga: Anuas air sin, tá freagracht dhíreach orthu i líon limistéir tháirgí príomhúla

source: The Department's Veterinary Public Health Inspectorate is responsible for official controls in milk pasteurisation, slaughterhouses, meat processing plants and egg product facilities
ga: Tá Cigireacht Sláinte Poiblí Tréidliachta na Roinne freagrach as rialuithe oifigiúla maidir le paistéaradh bainne, seamlais, ionaid phróiseála feola agus saoráidí táirgí uibheacha

source: HSE Environmental Health Officers
ga: Oifigigh Sláinte Chomhshaoil FSS

source: Environmental Health Officers are employed by the HSE and implement national and EU laws on food safety and hygiene
ga: Tá Oifigigh Sláinte Chomhshaoil fostaithe ag FSS agus cuireann siad dlíthe náisiúnta agus AE i bhfeidhm maidir le sábháilteacht agus sláinteachas bia

source: They sometimes provide services for the local authorities as well
ga: Soláthraíonn siad seirbhísí, corruair, do na húdaráis áitiúla chomh maith

source: Among their responsibilities in the food safety area are:
ga: I measc na bhfreagrachtaí atá orthu i limistéar na sábháilteachta bia, tá:

source: • Food control, including maintaining a register of food premises, inspecting all premises where food is manufactured or sold and investigating complaints about unfit food
ga: • Rialáil bia, lena n-áirítear clár áitribh bhia a choimeád, gach áitreabh ina ndéantar nó ina ndíoltar bia a scrúdú, chomh maith le gearáin i dtaobh bia do-ite a iniúchadh

source: • Enforcing the smoking laws in public places
ga: • Na dlíthe maidir le caitheamh tobac in áiteanna poiblí a chur i bhfeidhm

source: • Enforcing the rules on sale and storage of poisons
ga: • Na rialacha maidir le díol agus stóráil nimhe a chur i bhfeidhm

source: Environmental Health Officers have other public health and environmental functions, including pest control, monitoring of temporary dwellings, and inspection of public buildings such as schools and places of entertainment
ga: Tugann Oifigigh Sláinte Chomhshaoil faoi fheidhmeanna eile sláinte poiblí agus comhshaoil, lena n-áirítear srianadh lotnaidí, monatóireacht a dhéanamh ar áitribh shealadacha, agus cigireacht a dhéanamh ar fhoirgnimh phoiblí, ar nós scoileanna agus áiteanna siamsaíochta

source: Individuals may contact Environmental Health Officers to complain about matters such as hygiene in food premises or water quality
ga: Féadfaidh daoine aonair teagmháil a dhéanamh le hOifigigh Sláinte Comhshaoil chun gearán a dhéanamh faoi cheisteanna, ar nós sláinteachas in áitreabh bia nó cáilíocht an uisce

source: European Union food safety agencies
ga: Gníomhaireachtaí sábháilteachta bia an Aontais Eorpaigh

source: The European Food Safety Authority is an independent EU agency whose main role is to provide independent scientific advice
ga: Gníomhaireacht neamhspleách AE iad an tÚdarás Eorpach um Shábháilteacht Bhia arb iad a bpríomhról chun comhairle neamhspleách eolaíochta a sholáthar

source: It also assesses risks relating to the food chain and informs the public accordingly
ga: Anuas air sin, déanann siad measúnú ar rioscaí a bhaineann leis an slabhra bia agus cuireann siad an pobal ar an eolas dá réir sin

source: The European Commission includes a Directorate-General for Health and Food Safety
ga: Cuimsítear sa Choimisiún Eorpach Ard-Stiúrthóireacht Sláinte Poiblí agus Gnóthaí Tomhaltóirí

source: This Directorate General has responsibility for food inspection and control
ga: Tá an Ard-Stiúrthóireacht freagrach as rialú agus cigireacht bia

source: While the European Food Safety Authority advises on possible risk related to food safety, the responsibility for risk management lies with the EU institutions (the European Commission, Parliament and Council)
ga: Cé go gcuireann an tÚdarás Eorpach um Shábháilteacht Bia comhairle ar fáil maidir le sábháilteacht bia, is ar institiúidí an AE (an Coimisiún Eorpach, Parlaimint na hEorpa agus an Chomhairle Eorpach) atá an fhreagracht maidir le bainistíocht riosca

source: It is the role of the EU institutions, taking into account the European Food Safety Authority's advice and other considerations, to propose and adopt legislation, as well as regulatory and control measures as required
ga: Is é ról institiúidí an AE, nuair a chuirtear san áireamh chomhairle an Údaráis Eorpaigh um Shábháilteacht Bia agus nithe eile, chun reachtaíocht a bheartú agus glacadh léi, mar aon le bearta rialála agus rialaithe nuair a theastaíonn

source: The EU Food and Veterinary Office is responsible for monitoring compliance with various EU laws including those on food hygiene
ga: Tá Oifig Bia agus Tréidliachta an AE freagrach as monatóireacht a dhéanamh ar chomhlíonadh dlíthe éagsúla an AE, lena n-áirítear iad siúd a bhaineann le sláinteachas bia

source: It carries out inspections and audits in EU States and in countries exporting to the EU
ga: Tugann siad faoi chigireachtaí agus iniúchtaí i mBallstáit an AE agus i dtíortha a dhéanann easpórtáil chuig an AE

source: It also carries out audits regarding animal health and welfare, plant health, and the use of chemicals (such as pesticides, veterinary medicines and growth stimulants)
ga: Anuas air sin, tugann siad faoi iniúchtaí maidir le sláinte agus leas ainmhithe, sláinte plandaí, agus úsáid á bhaint as ceimiceáin (ar nós lotnaidicídí, cógais tréidliachta agus spreagthaigh fáis)
